software-engineering/schonig-mastering-postgresql-9-6/schonig-mastering-postgresql-9-6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notes on Mastering PostgreSQL 9.6</title>
<!-- 2018-01-12 Fri 20:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bart Frenk" />
</head>
<body>
<div id="content">
<h1 class="title">Notes on Mastering PostgreSQL 9.6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Meta</a></li>
<li><a href="#sec-2">2. Connection</a></li>
<li><a href="#sec-3">3. Contents</a>
<ul>
<li><a href="#sec-3-1">3.1. 1. PostgreSQL overview</a></li>
<li><a href="#sec-3-2">3.2. 2. Understanding transactions and locking</a></li>
<li><a href="#sec-3-3">3.3. 3. Making use of indexes</a></li>
<li><a href="#sec-3-4">3.4. <span class="todo STARTED">STARTED</span> 4. Handling advanced SQL</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Hypothetical aggregates</a></li>
<li><a href="#sec-3-4-2">3.4.2. Windowing queries</a></li>
<li><a href="#sec-3-4-3">3.4.3. Writing your own aggregates</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. 5. Log files and system statistics</a></li>
<li><a href="#sec-3-6">3.6. <span class="done DONE">DONE</span> 6. Optimizing queries for good performance</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. Optimization strategies</a></li>
<li><a href="#sec-3-6-2">3.6.2. Preliminaries</a></li>
<li><a href="#sec-3-6-3">3.6.3. Relevant system catalogs</a></li>
<li><a href="#sec-3-6-4">3.6.4. Node types in a query plan</a></li>
<li><a href="#sec-3-6-5">3.6.5. Understanding execution plans: Spotting problems</a></li>
<li><a href="#sec-3-6-6">3.6.6. Miscellaneous notes</a></li>
<li><a href="#sec-3-6-7">3.6.7. Partitioning data</a></li>
<li><a href="#sec-3-6-8">3.6.8. Adjusting parameters</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. <span class="done DONE">DONE</span> 7. Writing stored procedures</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1. Takeaways</a></li>
<li><a href="#sec-3-7-2">3.7.2. JavaScript is also available as trusted language</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8. 8. Managing PostreSQL security</a></li>
<li><a href="#sec-3-9">3.9. 9. Handling backup and recovery</a></li>
<li><a href="#sec-3-10">3.10. 10. Making sense of backups and replication</a></li>
<li><a href="#sec-3-11">3.11. 11. Deciding on useful extensions</a></li>
<li><a href="#sec-3-12">3.12. 12. Troubleshooting PostgreSQL</a></li>
<li><a href="#sec-3-13">3.13. 13. Migrating to PostgreSQL</a></li>
</ul>
</li>
<li><a href="#sec-4">4. References</a></li>
</ul>
</div>
</div>
<p>
AUTHOR: Bart Frenk
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Meta</h2>
<div class="outline-text-2" id="text-1">
<p>
Description: Notes on Schonig - Mastering PostgreSQL 9.6 (2017)
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Connection</h2>
<div class="outline-text-2" id="text-2">

<div class="org-src-container">

<pre class="src src-sql">SELECT * from t_oil LIMIT 2;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Contents</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 1. PostgreSQL overview</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 2. Understanding transactions and locking</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 3. Making use of indexes</h3>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="todo STARTED">STARTED</span> 4. Handling advanced SQL</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Hypothetical aggregates</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">

<pre class="src src-sql">SELECT region,
       rank(9000) WITHIN GROUP (ORDER BY production DESC NULL LAST)
       GROUP BY ROLLUP (1);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Windowing queries</h4>
<div class="outline-text-4" id="text-3-4-2">
</div><ol class="org-ol"><li><a id="sec-3-4-2-1" name="sec-3-4-2-1"></a>Partitioning data<br  /><div class="outline-text-5" id="text-3-4-2-1">
<ul class="org-ul">
<li>the number of rows returned doesn't change (unlike with GROUP BY)
</li>
<li>ordering within a partition matters for aggregation
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sql">SELECT country,
       year,
       production,
       consumption,
       avg(production) OVER (PARTITION BY country)
FROM t_oil;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql">SELECT country,
       year,
       production,
       min(production) OVER (),
       min(production) OVER (ORDER BY year)
FROM t_oil
WHERE year BETWEEN 1978 AND 1983
      AND country = 'Iran';
</pre>
</div>
</div>
</li>

<li><a id="sec-3-4-2-2" name="sec-3-4-2-2"></a>Using sliding windows<br  /><div class="outline-text-5" id="text-3-4-2-2">
<p>
This is a clear query to show the results of sliding windows.
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT *,
       array_agg(id) OVER (ORDER BY id ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING)
FROM generate_series(1, 5) as id;
</pre>
</div>

<ul class="org-ul">
<li>Can be unbounded on both sides by UNBOUNDED FOLLOWING, or UNBOUNDED PRECEDING
</li>
</ul>
</div>
</li>

<li><a id="sec-3-4-2-3" name="sec-3-4-2-3"></a>Abstracting window clauses<br  /><div class="outline-text-5" id="text-3-4-2-3">
<div class="org-src-container">

<pre class="src src-sql">SELECT country,
       year,
       production,
       min(production) OVER (w),
       max(production) OVER (w)
FROM t_oil
WHERE country = 'Canada' AND year BETWEEN 1980 AND 1985
WINDOW w AS (ORDER BY year)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">country</th>
<th scope="col" class="right">year</th>
<th scope="col" class="right">production</th>
<th scope="col" class="right">min</th>
<th scope="col" class="right">max</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Canada</td>
<td class="right">1980</td>
<td class="right">1764</td>
<td class="right">1764</td>
<td class="right">1764</td>
</tr>

<tr>
<td class="left">Canada</td>
<td class="right">1981</td>
<td class="right">1610</td>
<td class="right">1610</td>
<td class="right">1764</td>
</tr>

<tr>
<td class="left">Canada</td>
<td class="right">1982</td>
<td class="right">1590</td>
<td class="right">1590</td>
<td class="right">1764</td>
</tr>

<tr>
<td class="left">Canada</td>
<td class="right">1983</td>
<td class="right">1661</td>
<td class="right">1590</td>
<td class="right">1764</td>
</tr>

<tr>
<td class="left">Canada</td>
<td class="right">1984</td>
<td class="right">1775</td>
<td class="right">1590</td>
<td class="right">1775</td>
</tr>

<tr>
<td class="left">Canada</td>
<td class="right">1985</td>
<td class="right">1812</td>
<td class="right">1590</td>
<td class="right">1812</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-3-4-2-4" name="sec-3-4-2-4"></a>Various functions<br  /><div class="outline-text-5" id="text-3-4-2-4">
<ul class="org-ul">
<li>rank
</li>
<li>dense<sub>rank</sub>
</li>
<li>ntile
</li>
<li>lead
</li>
<li>lag
</li>
<li>first<sub>value</sub>
</li>
<li>nth<sub>value</sub>
</li>
<li>last<sub>value</sub>
</li>
<li>row<sub>number</sub>
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Writing your own aggregates</h4>
<div class="outline-text-4" id="text-3-4-3">
<div class="org-src-container">

<pre class="src src-sql">CREATE FUNCTION taxi_per_line (numeric, numeric)
RETURN numeric AS
$$
BEGIN
RAISE NOTICE 'intermediate: %, per row: %', $1, $2;
RETURN $1 + $2 * 2.2;
END;
$$ LANGUAGE 'plpgsql';
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql">CREATE AGGREGATE taxi_price (numeric)
(
    INITCOND = 2.5,
    SFUNC = taxi_per_line,
    STYPE = numeric
);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 5. Log files and system statistics</h3>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done DONE">DONE</span> 6. Optimizing queries for good performance</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Optimization strategies</h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li>constant folding
</li>
<li>view inlining
</li>
<li>join reordering
</li>
<li>flattening subselects
</li>
<li>join pruning
</li>
<li>applying equality constraints
</li>
<li>function inlining
</li>
<li>distribute over set operations (UNION [ALL], etc.)
</li>
</ul>

<p>
It is not difficult to make the process fail (e.g. by specifying OFFSET =
0). Always run explain on a query.
</p>
</div>
</div>
