software-engineering/schonig-mastering-postgresql-9-6/schonig-mastering-postgresql-9-6.html
<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> Preliminaries</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
Taken from <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>
</div>
</div>

<div id="outline-container-sec-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> Relevant system catalogs</h4>
<div class="outline-text-4" id="text-3-6-3">
<p>
pg<sub>class</sub> catalogs tables and most everything else that has columns or is
  otherwise similar to a table.
</p>
<ul class="org-ul">
<li>pg<sub>stats</sub> is a view on top of pg<sub>statistics</sub>
</li>
<li>pg<sub>statistics</sub> stores statistical data about the contents of the database
</li>
<li>pg<sub>stat</sub><sub>user</sub><sub>tables</sub> contains one row for each table in the current database,
showing statistics about accesses to that specific table
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-6-4" class="outline-4">
<h4 id="sec-3-6-4"><span class="section-number-4">3.6.4</span> Node types in a query plan</h4>
<div class="outline-text-4" id="text-3-6-4">
</div><ol class="org-ol"><li><a id="sec-3-6-4-1" name="sec-3-6-4-1"></a>Scans<br  /><ol class="org-ol"><li><a id="sec-3-6-4-1-1" name="sec-3-6-4-1-1"></a>Index-Only Scan<br  /><div class="outline-text-6" id="text-3-6-4-1-1">
<ul class="org-ul">
<li>Only needs to fetch index pages
</li>
<li>Requires data to be fetched to be available from the index
</li>
<li>MVCC visibility information is not stored in the index, but the table's
visibility map has a flag for each heap page that indicates when an
entire page is old enough to be visible to all current and future
transactions. (see <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>, Chapter 11.11 Index-Only Scans)
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-1-2" name="sec-3-6-4-1-2"></a>Index Scan<br  /><div class="outline-text-6" id="text-3-6-4-1-2">
<ul class="org-ul">
<li>Rows are fetched in index order from the index, and then separately
retrieved from the heap
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-1-3" name="sec-3-6-4-1-3"></a>Seq Scan<br  /><div class="outline-text-6" id="text-3-6-4-1-3">
<ul class="org-ul">
<li>Entire table is scanned
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-1-4" name="sec-3-6-4-1-4"></a>Bitmap Heap Scan<br  /><div class="outline-text-6" id="text-3-6-4-1-4">
<ul class="org-ul">
<li>Used after a Bitmap Index Scan, retrieves the pages selected by the Bitmap Index Scan
</li>
<li>Needs to apply the filter condition again, since rows in the heap page
fetched might not satisfy it.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-1-5" name="sec-3-6-4-1-5"></a>Bitmap Index Scan<br  /><div class="outline-text-6" id="text-3-6-4-1-5">
<ul class="org-ul">
<li>Gathers the pages of the rows to retrieved from the index
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-1-6" name="sec-3-6-4-1-6"></a>Function Scan<br  /></li></ol>
</li>
<li><a id="sec-3-6-4-2" name="sec-3-6-4-2"></a>Joins<br  /><ol class="org-ol"><li><a id="sec-3-6-4-2-1" name="sec-3-6-4-2-1"></a>Hash Join<br  /><div class="outline-text-6" id="text-3-6-4-2-1">
<ul class="org-ul">
<li>The rows of one of the tables are collected in a hash table (which one is indicated by Hash)
</li>
<li>These rows are then looked up from the row set of the other table
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-2-2" name="sec-3-6-4-2-2"></a>Merge Join<br  /><div class="outline-text-6" id="text-3-6-4-2-2">
<ul class="org-ul">
<li>Requires the tables to be sorted on fields in the join condition
</li>
<li>Merging then takes time proportional to the number sum of the rows of
the tables to merge.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-2-3" name="sec-3-6-4-2-3"></a>Nested Loop<br  /><div class="outline-text-6" id="text-3-6-4-2-3">
<ul class="org-ul">
<li>A nested loop takes time proportional to the products of the number of
rows to merge.
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-3-6-4-3" name="sec-3-6-4-3"></a>Miscellaneous<br  /><ol class="org-ol"><li><a id="sec-3-6-4-3-1" name="sec-3-6-4-3-1"></a>Append<br  /><div class="outline-text-6" id="text-3-6-4-3-1">
<ul class="org-ul">
<li>Appends to result sets
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-3-2" name="sec-3-6-4-3-2"></a>Unique<br  /><div class="outline-text-6" id="text-3-6-4-3-2">
<ul class="org-ul">
<li>Filter out duplicates
</li>
<li>Can be expensive (see <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>, p. 163)
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-3-3" name="sec-3-6-4-3-3"></a>Sort<br  /><div class="outline-text-6" id="text-3-6-4-3-3">
<ul class="org-ul">
<li>Sort the result set
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-3-6-4-3-3-1" name="sec-3-6-4-3-3-1"></a>external sort Disk<br  /></li>
<li><a id="sec-3-6-4-3-3-2" name="sec-3-6-4-3-3-2"></a>quicksort Memory<br  /></li>
<li><a id="sec-3-6-4-3-3-3" name="sec-3-6-4-3-3-3"></a>top-N heapsort Memory<br  /><div class="outline-text-7" id="text-3-6-4-3-3-3">
<ul class="org-ul">
<li>To only provide top-n rows
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-3-6-4-3-4" name="sec-3-6-4-3-4"></a>Limit<br  /><div class="outline-text-6" id="text-3-6-4-3-4">
<ul class="org-ul">
<li>Limits the result set
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-3-5" name="sec-3-6-4-3-5"></a>Subquery Scan<br  /></li></ol>
</li>

<li><a id="sec-3-6-4-4" name="sec-3-6-4-4"></a>Aggregates<br  /><ol class="org-ol"><li><a id="sec-3-6-4-4-1" name="sec-3-6-4-4-1"></a>HashAggregate<br  /><div class="outline-text-6" id="text-3-6-4-4-1">
<ul class="org-ul">
<li>Aggregate by building an in-memory hash table
</li>
</ul>
</div>
</li>
<li><a id="sec-3-6-4-4-2" name="sec-3-6-4-4-2"></a>GroupAggregate<br  /><div class="outline-text-6" id="text-3-6-4-4-2">
<ul class="org-ul">
<li>Requires sorted data
</li>
<li>Takes linear time, but can emit partial results
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>

<div id="outline-container-sec-3-6-5" class="outline-4">
<h4 id="sec-3-6-5"><span class="section-number-4">3.6.5</span> Understanding execution plans: Spotting problems</h4>
<div class="outline-text-4" id="text-3-6-5">
<ul class="org-ul">
<li>Start where the query times jump
</li>
<li>Inspect estimates
<ul class="org-ul">
<li>Maybe row sizes are over- or under-estimated due to wrong statistics
</li>
<li>Maybe cross-column correlations make the estimates off (statistics in
PostgreSQL 9.6 are univariate).
</li>
</ul>
</li>
<li>Inspect buffer usage
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-6-6" class="outline-4">
<h4 id="sec-3-6-6"><span class="section-number-4">3.6.6</span> Miscellaneous notes</h4>
<div class="outline-text-4" id="text-3-6-6">
</div><ol class="org-ol"><li><a id="sec-3-6-6-1" name="sec-3-6-6-1"></a>CLUSTER clauses<br  /><div class="outline-text-5" id="text-3-6-6-1">
<ul class="org-ul">
<li>Rewrite the table in the same order as a (B-tree) index (<sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup>,
p. 170). Requires a table lock.
</li>
</ul>
</div>
</li>

<li><a id="sec-3-6-6-2" name="sec-3-6-6-2"></a>Inner joins may be reordered<br  /><div class="outline-text-5" id="text-3-6-6-2">
<ul class="org-ul">
<li>Outer joins cannot always be reordered
</li>
<li>This is probably a restatement of the algebraic properties of both of
these types of joins in the relational algebra.
</li>
</ul>
</div>
</li>

<li><a id="sec-3-6-6-3" name="sec-3-6-6-3"></a>GROUP BY 1<br  /><div class="outline-text-5" id="text-3-6-6-3">
<ul class="org-ul">
<li>It is possible to specify only the indices of the column to group or
order by.
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-6-7" class="outline-4">
<h4 id="sec-3-6-7"><span class="section-number-4">3.6.7</span> Partitioning data</h4>
<div class="outline-text-4" id="text-3-6-7">
</div><ol class="org-ol"><li><a id="sec-3-6-7-1" name="sec-3-6-7-1"></a>Modifying inherited structure<br  /><div class="outline-text-5" id="text-3-6-7-1">
<ul class="org-ul">
<li>Adding and removing columns propagates to the child tables
</li>
<li>Adding indexes <b>does not</b>
</li>
<li>It is also simple to change the parent of the child table. Maybe for
moving data from active to history.
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-6-8" class="outline-4">
<h4 id="sec-3-6-8"><span class="section-number-4">3.6.8</span> Adjusting parameters</h4>
<div class="outline-text-4" id="text-3-6-8">
</div><ol class="org-ol"><li><a id="sec-3-6-8-1" name="sec-3-6-8-1"></a>work<sub>mem</sub><br  /><div class="outline-text-5" id="text-3-6-8-1">
<ul class="org-ul">
<li>Query plans obviously depend on working memory.
</li>
</ul>
</div>
</li>

<li><a id="sec-3-6-8-2" name="sec-3-6-8-2"></a>maintenance<sub>work</sub><sub>mem</sub><br  /><div class="outline-text-5" id="text-3-6-8-2">
<ul class="org-ul">
<li>Memory available for maintenance work (creating indices, etc.). Not so
useful, maybe for creating indices on the fly.
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="done DONE">DONE</span> 7. Writing stored procedures</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-sec-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> Takeaways</h4>
<div class="outline-text-4" id="text-3-7-1">
<ul class="org-ul">
<li>Probably better to use the jv8 extension that allows for using JavaScript
in PostgreSQL as a trusted language. Also pglpsql seems quite simple.
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-3-7-1-1" name="sec-3-7-1-1"></a>Triggers are useful and flexible<br  /><div class="outline-text-5" id="text-3-7-1-1">
<ul class="org-ul">
<li>They run in alphabetical order!
</li>
</ul>
</div>
</li>
<li><a id="sec-3-7-1-2" name="sec-3-7-1-2"></a>Types of functions<br  /><div class="outline-text-5" id="text-3-7-1-2">
<ul class="org-ul">
<li>volatile: no assumptions on return value
</li>
<li>stable: referentially transparent within a transaction
</li>
<li>immutable: referentially transparent
</li>
</ul>
</div>
</li>
<li><a id="sec-3-7-1-3" name="sec-3-7-1-3"></a>PL/pgSQL is simple and takes care of more things<br  /><div class="outline-text-5" id="text-3-7-1-3">
<ul class="org-ul">
<li>For example, caching execution plans (see <sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup>, p.228).
</li>
</ul>
</div>
</li>
<li><a id="sec-3-7-1-4" name="sec-3-7-1-4"></a>Can create your own operators, type casts, and even collations<br  /><div class="outline-text-5" id="text-3-7-1-4">
<ul class="org-ul">
<li>Collation is combining data, but I think refers mostly to sort orders in
this context.
</li>
</ul>
</div>
</li></ol>
</div>
